04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/simpleRushtonNCC/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [kinematicPressure];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            entrainmentPressure;
        p0              uniform 0;
        value           uniform 0;
    }

    stirrer
    {
        type            fixedFluxExtrapolatedPressure;
    }

    wall
    {
        type            fixedFluxExtrapolatedPressure;
    }

    "nonCouple.*"
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
